<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"gcs","backend":"97c852a2eff03745eacbf8375844c3a2051b82f44de5d352bef4b88a5a5143f9","plan_job_ref":"Job Plan Airflow DAGs #290 at https://github.com/cal-itp/data-infra/actions/runs/16299183970","plan_out_hash":"c48ed9a9f8441a75812cd06cd950beb4a310662b28c62d1558f08624b2a53e28","plan_hash":"c4ee3d89e5df3b4daa78048e5f799d806ac6eb221ca07752d888718af134ba80","plan_text_format":"diff","version":"1.49.0"} -->
Terraform plan in __iac/cal-itp-data-infra/airflow/us__
<details>
<summary>Plan: 0 to add, 1 to change, 0 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
!~  update in-place

Terraform will perform the following actions:

  # google_storage_bucket_object.calitp-composer-partial_parse will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-composer-partial_parse" {
!~      content             = (sensitive value)
!~      crc32c              = "OzNfuQ==" -> (known after apply)
!~      detect_md5hash      = "gQDYRjFTdm3tOMNXeu84Og==" -> "different hash"
!~      generation          = 1752010341206630 -> (known after apply)
        id                  = "calitp-composer-data/warehouse/target/partial_parse.msgpack"
!~      md5hash             = "gQDYRjFTdm3tOMNXeu84Og==" -> (known after apply)
        name                = "data/warehouse/target/partial_parse.msgpack"
#        (16 unchanged attributes hidden)
    }

Plan: 0 to add, 1 to change, 0 to destroy.
```
</details>

:memo: Plan generated in [Plan Airflow DAGs #290](https://github.com/cal-itp/data-infra/actions/runs/16299183970)